{
  "main": {
    "name":"Handy",
    "description":"Handy is a Hand Gesture Based Keyboard for the Blind. It is controlled through the use of American Sign Language (ASL) gestures",
    "image":"Profile Pic.png",
    "bio":"Through real-time detection, Handy uses our custom object detection model that is capable of recognising over 42 different gestures. These include 0-9, A-Z and 6 special characters: enter, delete, space, number mode, lower-case and upper-case mode",
    "demo":"https://drive.google.com/file/d/1C3UG0ifUw93UnXyu8h86ymt6rtc7I-3a/view?usp=sharing",
    "report":"https://drive.google.com/file/d/1C3UG0ifUw93UnXyu8h86ymt6rtc7I-3a/view?usp=sharing",
    "model":"",
    

    "social":[
      {
        "name":"facebook",
        "url":"",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"",
        "className":"fa fa-github"
      }
    ]
  },
  "userguide":{
    "motivation":[
      {
        "description":"Interacting with computers remains a challenge for the blind. Though braille-based keyboards are available, they usually have a limited number of keys. Interacting with computers via speech is another option; however, this is not a desirable solution in all situations, such as a competitive exam environment."
      }
    ],
    "instructions":[
      {
        "title":"How to get started?",
        "description":"To begin using the app, just click on one of the 'Get Started' button and you will be directed to the model page."
      },
      {
        "title":"Multi-Mode",
        "description":"To improve both model functionality and accuracy, a multi-mode system has been implemented on the app. These modes are number, lower-case and upper-case; when these gestures are signed and registerd, the model switches to that mode. The default mode is lower-case."
      }
    ],"models":[
      {
        "title":"3 Avaliable Models",
        "description":"Handy has 3 avaliable models to choose from. The default model, model 3, is the full-version of handy. This is a model capabale of detecting the full 42 gesture set, including the numbers, letters and special characters. Model 1 and 2 are faster models due to a more limited scope of detectable gestures. Model 1 is capable of detecting numbers 0-9; Model 2 is capable of detcting letters A-Z and the special characters."
      }
    ],
    "tips":[
      {
        "description":"The audio feedback system has been integrated to inform blind users when a gesture has been detected. My recommendation is to keep the gesture upheld to your side for a just over a second or so until the audio prompt is heard."
      }
    ]
  }
}
